## Creating a dataFrames

In [2]:
import numpy as np

In [83]:
import pandas as pd

In [6]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)

In [7]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [11]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2=pd.DataFrame(data_list)
colums=["name","age","city","salary"]
df2=pd.DataFrame(data_list,columns=colums)

In [12]:
df2

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

## selection and indexing of columns

In [20]:
print("Print the df2")
print(df2)

Print the df2
    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [14]:
df2["name"]

0     John
1     Anna
2    Peter
3    Linda
Name: name, dtype: object

In [15]:
df2['city']

0    New York
1       Paris
2      Berlin
3      London
Name: city, dtype: object

In [24]:
print("Printing the name and city")
df2[['name','city']]

Printing the name and city

    name      city
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

## creating a new Columns

In [47]:
df2["designation"]= ["Actor", "Doctor","engineers","CEO"]

In [39]:
df2

    name  age      city  salary designation
0   John   28  New York   65000       Actor
1   Anna   34     Paris   70000      Doctor
2  Peter   29    Berlin   62000   engineers
3  Linda   42    London   85000         CEO

## Removing Columns

In [48]:
df2.drop('designation',axis=1)

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [49]:
df2

    name  age      city  salary designation
0   John   28  New York   65000       Actor
1   Anna   34     Paris   70000      Doctor
2  Peter   29    Berlin   62000   engineers
3  Linda   42    London   85000         CEO

In [53]:
df2.drop(['city','salary'],axis=1)

    name  age
0   John   28
1   Anna   34
2  Peter   29
3  Linda   42

In [54]:
df2

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [61]:
print("zero index  removes ")
df2.drop(0,axis=0)

zero index  removes

    name  age    city  salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin   62000
3  Linda   42  London   85000

In [60]:
print("first index removes ")
df2.drop(1,axis=0)

first index removes

    name  age      city  salary
0   John   28  New York   65000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

## Selecting a row

In [62]:
df2

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [64]:
df2.loc[0]

name          John
age             28
city      New York
salary       65000
Name: 0, dtype: object

In [66]:
df2.loc[[0,1]]

   name  age      city  salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

## Selcting subset of row and columsm

In [67]:
df2.loc[[0,1]][["city","salary"]]

       city  salary
0  New York   65000
1     Paris   70000

In [69]:
df2.loc[[2,3]][["city","salary"]]

     city  salary
2  Berlin   62000
3  London   85000

In [70]:
df2.loc[[0,1]][["name","age"]]

   name  age
0  John   28
1  Anna   34

In [71]:
df2.loc[[2,3]][["name","age"]]

    name  age
2  Peter   29
3  Linda   42

## conditional selection

In [72]:
df2

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [81]:
print("select people those age os above 30")
df2[df2["age"]>30]

select people those age os above 30

    name  age    city  salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [85]:
print("select people those age os above 30 and their city paris ")
df2[(df2["age"] > 30) & (df2["city"] == 'paris')]

select people those age os above 30 and their city paris

Empty DataFrame
Columns: [name, age, city, salary]
Index: []

In [86]:
df2

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [88]:
df2[(df2["age"] > 30) & (df2["city"] == 'Paris')]

   name  age   city  salary
1  Anna   34  Paris   70000